Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_1 (RBFLayer)       (None, 57)                106476    
_________________________________________________________________
dense_1 (Dense)              (None, 57)                3306      
=================================================================
Total params: 109,782
Trainable params: 109,782
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 71.35242156564118
number of epochs is 100