Model: "sequential_94"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_94 (RBFLayer)      (None, 5)                 10005     
_________________________________________________________________
dense_94 (Dense)             (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
