Model: "sequential_16"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_16 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_16 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_16 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_32 (Dense)             (None, 490)               8295210   
_________________________________________________________________
dropout_16 (Dropout)         (None, 490)               0         
_________________________________________________________________
dense_33 (Dense)             (None, 2)                 982       
=================================================================
Total params: 8,298,752
Trainable params: 8,298,688
Non-trainable params: 64
_________________________________________________________________
