Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_8 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_16 (Dense)             (None, 250)               4232250   
_________________________________________________________________
dropout_8 (Dropout)          (None, 250)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 2)                 502       
=================================================================
Total params: 4,235,312
Trainable params: 4,235,248
Non-trainable params: 64
_________________________________________________________________
