Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_15 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_15 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_30 (Dense)             (None, 460)               7787340   
_________________________________________________________________
dropout_15 (Dropout)         (None, 460)               0         
_________________________________________________________________
dense_31 (Dense)             (None, 2)                 922       
=================================================================
Total params: 7,790,822
Trainable params: 7,790,758
Non-trainable params: 64
_________________________________________________________________
