Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 44, 44, 32)        4736      
_________________________________________________________________
batch_normalization_6 (Batch (None, 44, 44, 32)        128       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 40, 40, 64)        51264     
_________________________________________________________________
batch_normalization_7 (Batch (None, 40, 40, 64)        256       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 38, 38, 128)       73856     
_________________________________________________________________
batch_normalization_8 (Batch (None, 38, 38, 128)       512       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 19, 19, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 46208)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               11829504  
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 514       
=================================================================
Total params: 11,960,770
Trainable params: 11,960,322
Non-trainable params: 448
_________________________________________________________________
