Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 96, 96, 32)        2432      
_________________________________________________________________
batch_normalization_8 (Batch (None, 96, 96, 32)        128       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 48, 48, 32)        0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 73728)             0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               18874624  
_________________________________________________________________
dropout_8 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 57)                14649     
=================================================================
Total params: 18,891,833
Trainable params: 18,891,769
Non-trainable params: 64
_________________________________________________________________
