Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 96, 96, 32)        2432      
_________________________________________________________________
batch_normalization_7 (Batch (None, 96, 96, 32)        128       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 48, 48, 32)        0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 73728)             0         
_________________________________________________________________
dense_14 (Dense)             (None, 256)               18874624  
_________________________________________________________________
dropout_7 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 57)                14649     
=================================================================
Total params: 18,891,833
Trainable params: 18,891,769
Non-trainable params: 64
_________________________________________________________________
