Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer (RBFLayer)         (None, 2)                 4002      
_________________________________________________________________
dense (Dense)                (None, 2)                 6         
=================================================================
Total params: 4,008
Trainable params: 4,008
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 88.76080691642652
number of epochs is 1000