Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 46, 46, 128)       9728      
_________________________________________________________________
batch_normalization_7 (Batch (None, 46, 46, 128)       512       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 44, 44, 128)       147584    
_________________________________________________________________
batch_normalization_8 (Batch (None, 44, 44, 128)       512       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 22, 22, 128)       0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 61952)             0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               15859968  
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 514       
=================================================================
Total params: 16,018,818
Trainable params: 16,018,306
Non-trainable params: 512
_________________________________________________________________
