Model: "sequential_39"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_39 (RBFLayer)      (None, 5)                 10005     
_________________________________________________________________
dense_39 (Dense)             (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 34.32494279176201
number of epochs is 200