Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 500)               878000    
_________________________________________________________________
dense_1 (Dense)              (None, 50)                25050     
=================================================================
Total params: 903,050
Trainable params: 903,050
Non-trainable params: 0
_________________________________________________________________
