Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_2 (RBFLayer)       (None, 57)                106476    
_________________________________________________________________
dense_2 (Dense)              (None, 57)                3306      
=================================================================
Total params: 109,782
Trainable params: 109,782
Non-trainable params: 0
_________________________________________________________________
