Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_15 (Conv2D)           (None, 44, 44, 32)        4736      
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 22, 22, 32)        0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 18, 18, 64)        51264     
_________________________________________________________________
max_pooling2d_16 (MaxPooling (None, 9, 9, 64)          0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 7, 7, 128)         73856     
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 3, 3, 128)         0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 1152)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               295168    
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 514       
=================================================================
Total params: 425,538
Trainable params: 425,538
Non-trainable params: 0
_________________________________________________________________
