Model: "sequential_8"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 46, 46, 128)       9728      
_________________________________________________________________
batch_normalization_13 (Batc (None, 46, 46, 128)       512       
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 44, 44, 128)       147584    
_________________________________________________________________
batch_normalization_14 (Batc (None, 44, 44, 128)       512       
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 22, 22, 128)       0         
_________________________________________________________________
flatten_8 (Flatten)          (None, 61952)             0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               15859968  
_________________________________________________________________
dropout_8 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 3469)              891533    
=================================================================
Total params: 16,909,837
Trainable params: 16,909,325
Non-trainable params: 512
_________________________________________________________________
