Model: "sequential_99"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_99 (RBFLayer)      (None, 5)                 10005     
_________________________________________________________________
dense_99 (Dense)             (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 81.23569794050344
number of epochs is 200