Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_4 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               4333824   
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 5)                 1285      
=================================================================
Total params: 4,337,669
Trainable params: 4,337,605
Non-trainable params: 64
_________________________________________________________________
percentage correct on test set is 90.85714285714286
The time taken to complete this program was 100.11153769493103