Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_2 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
module_wrapper_1 (ModuleWrap (None, 15, 15, 32)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 11, 11, 64)        51264     
_________________________________________________________________
batch_normalization_3 (Batch (None, 11, 11, 64)        256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 7744)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               1982720   
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 57)                14649     
=================================================================
Total params: 2,051,449
Trainable params: 2,051,257
Non-trainable params: 192
_________________________________________________________________
