Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_3 (RBFLayer)       (None, 5)                 10005     
_________________________________________________________________
dense_3 (Dense)              (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 22.19679633867277
number of epochs is 1