Model: "sequential_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_7 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_7 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_14 (Dense)             (None, 400)               6771600   
_________________________________________________________________
dropout_7 (Dropout)          (None, 400)               0         
_________________________________________________________________
dense_15 (Dense)             (None, 2)                 802       
=================================================================
Total params: 6,774,962
Trainable params: 6,774,898
Non-trainable params: 64
_________________________________________________________________
