Model: "sequential_14"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_14 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_14 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_14 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_28 (Dense)             (None, 200)               3385800   
_________________________________________________________________
dropout_14 (Dropout)         (None, 200)               0         
_________________________________________________________________
dense_29 (Dense)             (None, 2)                 402       
=================================================================
Total params: 3,388,762
Trainable params: 3,388,698
Non-trainable params: 64
_________________________________________________________________
