Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_9 (RBFLayer)       (None, 57)                106476    
_________________________________________________________________
dense_9 (Dense)              (None, 57)                3306      
=================================================================
Total params: 109,782
Trainable params: 109,782
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 49.87816021931161
number of epochs is 1