Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 44, 44, 128)       18944     
_________________________________________________________________
batch_normalization (BatchNo (None, 44, 44, 128)       512       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 40, 40, 256)       819456    
_________________________________________________________________
batch_normalization_1 (Batch (None, 40, 40, 256)       1024      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 20, 20, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 102400)            0         
_________________________________________________________________
dense (Dense)                (None, 256)               26214656  
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 514       
=================================================================
Total params: 27,055,106
Trainable params: 27,054,338
Non-trainable params: 768
_________________________________________________________________
