Model: "sequential_85"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_85 (RBFLayer)      (None, 2)                 4002      
_________________________________________________________________
dense_85 (Dense)             (None, 2)                 6         
=================================================================
Total params: 4,008
Trainable params: 4,008
Non-trainable params: 0
_________________________________________________________________
