Model: "sequential_99"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_99 (RBFLayer)      (None, 2)                 4002      
_________________________________________________________________
dense_99 (Dense)             (None, 2)                 6         
=================================================================
Total params: 4,008
Trainable params: 4,008
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 83.28530259365994
number of epochs is 600