Model: "sequential_39"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_39 (RBFLayer)      (None, 2)                 4002      
_________________________________________________________________
dense_39 (Dense)             (None, 2)                 6         
=================================================================
Total params: 4,008
Trainable params: 4,008
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 55.61959654178674
number of epochs is 600