Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 500)               1000500   
_________________________________________________________________
dense_1 (Dense)              (None, 2)                 1002      
=================================================================
Total params: 1,001,502
Trainable params: 1,001,502
Non-trainable params: 0
_________________________________________________________________
