Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 96, 96, 32)        2432      
_________________________________________________________________
batch_normalization_4 (Batch (None, 96, 96, 32)        128       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 48, 48, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 73728)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 400)               29491600  
_________________________________________________________________
dropout_4 (Dropout)          (None, 400)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 57)                22857     
=================================================================
Total params: 29,517,017
Trainable params: 29,516,953
Non-trainable params: 64
_________________________________________________________________
percentage correct on test set is 71.42313256681642
The time taken to complete this program was 5324.526057481766