Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 500)               1000500   
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 2505      
=================================================================
Total params: 1,003,005
Trainable params: 1,003,005
Non-trainable params: 0
_________________________________________________________________
