Model: "sequential_18"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_18 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_18 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_18 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_18 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_36 (Dense)             (None, 550)               9310950   
_________________________________________________________________
dropout_18 (Dropout)         (None, 550)               0         
_________________________________________________________________
dense_37 (Dense)             (None, 57)                31407     
=================================================================
Total params: 9,344,917
Trainable params: 9,344,853
Non-trainable params: 64
_________________________________________________________________
