Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_11 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_22 (Dense)             (None, 340)               5755860   
_________________________________________________________________
dropout_11 (Dropout)         (None, 340)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 57)                19437     
=================================================================
Total params: 5,777,857
Trainable params: 5,777,793
Non-trainable params: 64
_________________________________________________________________
