Model: "sequential_12"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_12 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_12 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_24 (Dense)             (None, 370)               6263730   
_________________________________________________________________
dropout_12 (Dropout)         (None, 370)               0         
_________________________________________________________________
dense_25 (Dense)             (None, 57)                21147     
=================================================================
Total params: 6,287,437
Trainable params: 6,287,373
Non-trainable params: 64
_________________________________________________________________
