Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_5 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_5 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_10 (Dense)             (None, 160)               2708640   
_________________________________________________________________
dropout_5 (Dropout)          (None, 160)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 57)                9177      
=================================================================
Total params: 2,720,377
Trainable params: 2,720,313
Non-trainable params: 64
_________________________________________________________________
