Model: "sequential_17"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_17 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_17 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_17 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_17 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_34 (Dense)             (None, 520)               8803080   
_________________________________________________________________
dropout_17 (Dropout)         (None, 520)               0         
_________________________________________________________________
dense_35 (Dense)             (None, 57)                29697     
=================================================================
Total params: 8,835,337
Trainable params: 8,835,273
Non-trainable params: 64
_________________________________________________________________
