Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_4 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 130)               2200770   
_________________________________________________________________
dropout_4 (Dropout)          (None, 130)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 57)                7467      
=================================================================
Total params: 2,210,797
Trainable params: 2,210,733
Non-trainable params: 64
_________________________________________________________________
