Model: "sequential_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_13 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_13 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_13 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_26 (Dense)             (None, 400)               6771600   
_________________________________________________________________
dropout_13 (Dropout)         (None, 400)               0         
_________________________________________________________________
dense_27 (Dense)             (None, 57)                22857     
=================================================================
Total params: 6,797,017
Trainable params: 6,796,953
Non-trainable params: 64
_________________________________________________________________
