Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_6 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 190)               3216510   
_________________________________________________________________
dropout_6 (Dropout)          (None, 190)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 57)                10887     
=================================================================
Total params: 3,229,957
Trainable params: 3,229,893
Non-trainable params: 64
_________________________________________________________________
