Model: "sequential_19"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_19 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_19 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_19 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_19 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_38 (Dense)             (None, 580)               9818820   
_________________________________________________________________
dropout_19 (Dropout)         (None, 580)               0         
_________________________________________________________________
dense_39 (Dense)             (None, 57)                33117     
=================================================================
Total params: 9,854,497
Trainable params: 9,854,433
Non-trainable params: 64
_________________________________________________________________
