Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_3 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_3 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 100)               1692900   
_________________________________________________________________
dropout_3 (Dropout)          (None, 100)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 57)                5757      
=================================================================
Total params: 1,701,217
Trainable params: 1,701,153
Non-trainable params: 64
_________________________________________________________________
