Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_1 (RBFLayer)       (None, 5)                 10005     
_________________________________________________________________
dense_1 (Dense)              (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 99.77116704805492
number of epochs is 200