Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer (RBFLayer)         (None, 5)                 10005     
_________________________________________________________________
dense (Dense)                (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 56.06407322654462
number of epochs is 1000