Model: "sequential_78"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_78 (RBFLayer)      (None, 2)                 4002      
_________________________________________________________________
dense_78 (Dense)             (None, 2)                 6         
=================================================================
Total params: 4,008
Trainable params: 4,008
Non-trainable params: 0
_________________________________________________________________
