Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_6 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
module_wrapper_3 (ModuleWrap (None, 23, 23, 32)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 19, 19, 64)        51264     
_________________________________________________________________
batch_normalization_7 (Batch (None, 19, 19, 64)        256       
_________________________________________________________________
flatten_3 (Flatten)          (None, 23104)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 256)               5914880   
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 514       
=================================================================
Total params: 5,969,474
Trainable params: 5,969,282
Non-trainable params: 192
_________________________________________________________________
