Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_10 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
module_wrapper_5 (ModuleWrap (None, 11, 11, 32)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 7, 7, 64)          51264     
_________________________________________________________________
batch_normalization_11 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
flatten_5 (Flatten)          (None, 3136)              0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               803072    
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 2)                 514       
=================================================================
Total params: 857,666
Trainable params: 857,474
Non-trainable params: 192
_________________________________________________________________
