Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_2 (Conv2D)            (None, 46, 46, 128)       9728      
_________________________________________________________________
batch_normalization_2 (Batch (None, 46, 46, 128)       512       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 23, 23, 128)       0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 67712)             0         
_________________________________________________________________
dense_4 (Dense)              (None, 256)               17334528  
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 57)                14649     
=================================================================
Total params: 17,359,417
Trainable params: 17,359,161
Non-trainable params: 256
_________________________________________________________________
