Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer (RBFLayer)         (None, 57)                106476    
_________________________________________________________________
dense (Dense)                (None, 57)                3306      
=================================================================
Total params: 109,782
Trainable params: 109,782
Non-trainable params: 0
_________________________________________________________________
percentage accuracy on test set is 72.41851964666463
number of epochs is 100