Model: "sequential_15"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_15 (RBFLayer)      (None, 5)                 10005     
_________________________________________________________________
dense_15 (Dense)             (None, 5)                 30        
=================================================================
Total params: 10,035
Trainable params: 10,035
Non-trainable params: 0
_________________________________________________________________
