Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_8 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_8 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
module_wrapper_4 (ModuleWrap (None, 15, 15, 32)        0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 11, 11, 64)        51264     
_________________________________________________________________
batch_normalization_9 (Batch (None, 11, 11, 64)        256       
_________________________________________________________________
flatten_4 (Flatten)          (None, 7744)              0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               1982720   
_________________________________________________________________
dropout_4 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 514       
=================================================================
Total params: 2,037,314
Trainable params: 2,037,122
Non-trainable params: 192
_________________________________________________________________
