Model: "sequential_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_10 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_10 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_20 (Dense)             (None, 256)               4333824   
_________________________________________________________________
dropout_10 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_21 (Dense)             (None, 2)                 514       
=================================================================
Total params: 4,336,898
Trainable params: 4,336,834
Non-trainable params: 64
_________________________________________________________________
