Model: "sequential_11"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_11 (Conv2D)           (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_11 (Batc (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_11 (Flatten)         (None, 16928)             0         
_________________________________________________________________
dense_22 (Dense)             (None, 256)               4333824   
_________________________________________________________________
dropout_11 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 2)                 514       
=================================================================
Total params: 4,336,898
Trainable params: 4,336,834
Non-trainable params: 64
_________________________________________________________________
