Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_6 (Conv2D)            (None, 96, 96, 32)        2432      
_________________________________________________________________
batch_normalization_6 (Batch (None, 96, 96, 32)        128       
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 48, 48, 32)        0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 73728)             0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               18874624  
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 3469)              891533    
=================================================================
Total params: 19,768,717
Trainable params: 19,768,653
Non-trainable params: 64
_________________________________________________________________
