Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 500)               934000    
_________________________________________________________________
dense_1 (Dense)              (None, 57)                28557     
=================================================================
Total params: 962,557
Trainable params: 962,557
Non-trainable params: 0
_________________________________________________________________
