Model: "sequential_9"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_9 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_9 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_18 (Dense)             (None, 256)               4333824   
_________________________________________________________________
dropout_9 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 57)                14649     
=================================================================
Total params: 4,351,033
Trainable params: 4,350,969
Non-trainable params: 64
_________________________________________________________________
