Model: "sequential_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_4 (Conv2D)            (None, 46, 46, 32)        2432      
_________________________________________________________________
batch_normalization_4 (Batch (None, 46, 46, 32)        128       
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 23, 23, 32)        0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 16928)             0         
_________________________________________________________________
dense_8 (Dense)              (None, 200)               3385800   
_________________________________________________________________
dropout_4 (Dropout)          (None, 200)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 2)                 402       
=================================================================
Total params: 3,388,762
Trainable params: 3,388,698
Non-trainable params: 64
_________________________________________________________________
percentage correct on test set is 94.95677233429394
precision score: [0.94160584 0.96113074]recall score: [0.97236181 0.91891892] accuracy: 94.95677233429394