Model: "sequential_20"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
rbf_layer_20 (RBFLayer)      (None, 57)                106476    
_________________________________________________________________
dense_20 (Dense)             (None, 57)                3306      
=================================================================
Total params: 109,782
Trainable params: 109,782
Non-trainable params: 0
_________________________________________________________________
